{
   "Armor":{
	  "description":"Armor defense points.",
	  "category":"Generic",
	  "id":"generic.armor",
	  "min":"0",
	  "max":"30"
   },
   "Armor Toughness":{
	  "description":"Armor toughness.",
	  "category":"Generic",
	  "id":"generic.armor_toughness",
	  "min":"0",
	  "max":"20"
   },
   "Attack Damage":{
	  "description":"Damage dealt by attacks, in half-hearts.",
	  "category":"Generic",
	  "id":"generic.attack_damage",
	  "min":"0",
	  "max":"2048"
   },
   "Attack Knockback":{
	  "description":"Knockback applied to attacks. Applies only to mobs with physical attacks.[3]",
	  "category":"Generic",
	  "id":"generic.attack_knockback",
	  "min":"0",
	  "max":"5"
   },
   "Attack Speed":{
	  "description":"Determines recharging rate of attack strength. Value is the number of full-strength attacks per second.",
	  "category":"Generic",
	  "id":"generic.attack_speed",
	  "min":"0",
	  "max":"1024"
   },
   "Flying Speed":{
	  "description":"Flight speed modifier in some unknown metric.",
	  "category":"Generic",
	  "id":"generic.flying_speed",
	  "min":"0",
	  "max":"1024"
   },
   "Follow Range":{
	  "description":"The range in blocks within which a mob with this attribute targets players or other mobs to track. Exiting this range causes the mob to cease following the player/mob. Actual value used by most mobs is 16; for zombies it is 35.",
	  "category":"Generic",
	  "id":"generic.follow_range",
	  "min":"0",
	  "max":"2048"
   },
   "Knockback Resistance":{
	  "description":"The scale of horizontal knockback resisted from attacks and projectiles. Vertical knockback is not affected. Does not affect explosions.[4] The resistance functions as a percentage from 0.0 (0% resistance) to 1.0 (100% resistance) (e.g. 0.4 is 40% resistance, meaning the attributed mob will only take 60% of usual knockback). Note that Iron Golems and Wardens suffer zero knockback from attacks or projectiles.",
	  "category":"Generic",
	  "id":"generic.knockback_resistance",
	  "min":"0",
	  "max":"1"
   },
   "Luck":{
	  "description":"Affects the results of loot tables using the quality or bonus_rolls tag (e.g. when opening chests or chest minecarts, fishing, and killing mobs).",
	  "category":"Generic",
	  "id":"generic.luck",
	  "min":"-1024",
	  "max":"1024"
   },
   "Max Absorption":{
	  "description":"The maximum absorption of this mob (in half-hearts); determines the highest health they may gain by the Absorption effect.",
	  "category":"Generic",
	  "id":"generic.max_absorption",
	  "min":"0",
	  "max":"2048"
   },
   "Max Health":{
	  "description":"The maximum health of this mob (in half-hearts); determines the highest health they may be healed to. If the player is using this to summon a mob with high health, use this and the Health tag {Health:200.0f} for example. (Disabled in 1.17)",
	  "category":"Generic",
	  "id":"generic.max_health",
	  "min":"1",
	  "max":"1024"
   },
   "Movement Speed":{
	  "description":"Movement speed is the speed at which entities can move, but this is not the actual speed value in blocks/second. The mob's actual speed in blocks/second is a bit over 20 times this value, but is affected by various conditions, such as the behavior it's following (e.g. idling, attacking or fleeing), being ridden (if a horse), sprinting, being led by a leash, and being under the effect of a Speed or Slowness potion. Baby mobs also have an additional speed multiplier on top of the base value.",
	  "category":"Generic",
	  "id":"generic.movement_speed",
	  "min":"0",
	  "max":"1024"
   },
   "Scale":{
	  "description":"The multiplier of the size of an entity.",
	  "category":"Generic",
	  "id":"generic.scale",
	  "min":"0.0625",
	  "max":"16"
   },
   "Step Height":{
	  "description":"The maximum number of blocks that an entity can step up without jumping.",
	  "category":"Generic",
	  "id":"generic.step_height",
	  "min":"0",
	  "max":"10.125"
   },
   "Jump Strength":{
	  "description":"The height an entity can jump, similar to the Jump Boost effect.",
	  "category":"Generic",
	  "id":"generic.jump_strength",
	  "min":"0",
	  "max":"32"
   },
   "Gravity":{
	  "description":"The gravity affecting an entity in blocks per tick squared.",
	  "category":"Generic",
	  "id":"generic.gravity",
	  "min":"-1",
	  "max":"1"
   },
   "Safe Fall Distance":{
	  "description":"The number of blocks an entity can fall before fall damage starts to be accumulated. Also the minimum amount of blocks the entity has to fall to make fallling particles and sounds.",
	  "category":"Generic",
	  "id":"generic.safe_fall_distance",
	  "min":"-1024",
	  "max":"1024"
   },
   "Fall Damage Multiplier":{
	  "description":"The amount of fall damage an entity takes as a multiplier.",
	  "category":"Generic",
	  "id":"generic.fall_damage_multiplier",
	  "min":"0",
	  "max":"100"
   },
   "Burning Time":{
	  "description":"Amount of time how long an entity remains on fire after being ignited as a multiplier. A value of 0 eliminates the burn time. Has no impact on the burning time increase when staying in fire.",
	  "category":"Generic",
	  "id":"generic.burning_time",
	  "min":"0",
	  "max":"1024"
   },
   "Explosion Knockback Resistance":{
	  "description":"Defines what percentage of knockback an entity resists. A value of 1 eliminates the knockback.",
	  "category":"Generic",
	  "id":"generic.explosion_knockback_resistance",
	  "min":"0",
	  "max":"1"
   },
   "Movement Efficiency":{
	  "description":"A factor to improve walking on terrain that slows down movement. A value of 1 removes the slowing down.",
	  "category":"Generic",
	  "id":"generic.movement_efficiency",
	  "min":"0",
	  "max":"1"
   },
   "Oxygen Bonus":{
	  "description":"Value to determine the chance for an entity to not use up air when underwater. The chance is calculated according to this formula: 1 / (oxygen_bonus + 1)",
	  "category":"Generic",
	  "id":"generic.oxygen_bonus",
	  "min":"0",
	  "max":"1024"
   },
   "Water Movement Efficiency":{
	  "description":"The movement speed factor when submerged. A higher value lets entities move faster. This only represents the submersion factor itself, other factors (such as not touching the ground) also apply.",
	  "category":"Generic",
	  "id":"generic.water_movement_efficiency",
	  "min":"0",
	  "max":"1"
   },
   "Block Interaction Range":{
	  "description":"The block interaction range for players in blocks.",
	  "category":"Player",
	  "id":"player.block_interaction_range",
	  "min":"0",
	  "max":"64"
   },
   "Entity Interaction Range":{
	  "description":"The entity interaction range for players in blocks.",
	  "category":"Player",
	  "id":"player.entity_interaction_range",
	  "min":"0",
	  "max":"64"
   },
   "Block Break Speed":{
	  "description":"The speed the player can break blocks as a multiplier.",
	  "category":"Player",
	  "id":"player.block_break_speed",
	  "min":"0",
	  "max":"1024"
   },
   "Mining Efficiency":{
	  "description":"A factor to speed up the mining of blocks when using the right tool.",
	  "category":"Player",
	  "id":"player.mining_efficiency",
	  "min":"0",
	  "max":"1024"
   },
   "Sneaking Speed":{
	  "description":"The movement speed factor when sneaking or crawling. A factor of 1 means sneaking or crawling is as fast as walking, a factor of 0 means unable to move while sneaking or crawling. A factor of at least 0.8 also allows starting sprinting while sneaking or crawling using the sprint key but not by double tapping.",
	  "category":"Player",
	  "id":"player.sneaking_speed",
	  "min":"0",
	  "max":"1"
   },
   "Submerged Mining Speed":{
	  "description":"The mining speed factor when underwater. A factor of 1 means mining as fast as on land, a factor of 0 means unable to mine while submerged. This only represents the submersion factor itself, other factors (such as not touching the ground) also apply.",
	  "category":"Player",
	  "id":"player.submerged_mining_speed",
	  "min":"0",
	  "max":"20"
   },
   "Sweeping Damage Ratio":{
	  "description":"Determines how much of the base attack damage gets transferred to secondary targets in a sweep attack. This is in addition to the base attack of the sweep damage itself. A value of 1 means that all of the base attack damage is transferred (sweep damage is attack_damage + 1)",
	  "category":"Player",
	  "id":"player.sweeping_damage_ratio",
	  "min":"0",
	  "max":"1"
   },
   "Spawn Reinforcements":{
	  "description":"Chance for a zombie to spawn another zombie when attacked.",
	  "category":"Zombie",
	  "id":"zombie.spawn_reinforcements",
	  "min":"0",
	  "max":"1"
   }
}
